brew "asmvik/formulae/skhd"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Diff that understands syntax
brew "difftastic"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Terminal-based visual file manager
brew "midnight-commander"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
cask "1password"
# Memory training application
cask "anki"
cask "font-cascadia-code"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Windows manager and desktop organiser
cask "hazeover"
# Multi-platform web browser
cask "microsoft-edge"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
cask "warp"
mas "1Password for Safari", id: 1569813296
mas "Menu World Time", id: 1446377255
mas "Perplexity", id: 6714467650
mas "Things", id: 904280696
